---
layout: default
---

            <div class="row">
               <div class="col-md-12">
                   <div class="bg-title">
                       <h1 class="shadow text-sm-center">Robik</h1>
                       <h3 class="shadow text-sm-center text-sm-pequeno">El robot imprimible que puede mover el cubo de Rubik</h3>
                   </div>
                   <div>
                       <div class="bg-foto"></div>
                   </div>
               </div>
            </div>

            <div class="row">
                <div class="col-md-4">
                    <div class="thumbnail">
                        <div class="caption">
                            <h3>
                            <span class="glyphicon  glyphicon-align-left" aria-hidden="true"></span>
                            Lista de materiales</h3>
                            <p>
                                Adem&aacute;s de las piezas impresas en 3D, necesitas una placa Arduino (nosotros utilizamos un UNO), un motor paso a paso con su correspondiente driver, tres servos y algunas "vitaminas" como tornillos y tuercas, rodamientos...
                                <p><a href="materiales.html" class="btn btn-primary" role="button">Ver m&aacute;s...</a> </p>
                        </div>
                    </div>
                </div>
                <div class="col-md-4">
                    <div class="thumbnail">
                        <div class="caption">
                            <h3>
                            <span class="glyphicon glyphicon-wrench glyphicon-align-left" aria-hidden="true"></span>
                            Gu&iacute;a de construcci&oacute;n</h3>
                            <p>
                                Aunque el robot es muy sencillo de construir, tanto su parte electr&oacute;nica como su parte mec&aacute;nica, aqu&iacute; puedes ver una peque&ntilde;a gu&iacute;a fotogr&aacute;fica para ayudarte en el proceso.
                                <p><a href="construccion.html" class="btn btn-primary" role="button">Ver m&aacute;s</a> </p>
                        </div>
                    </div>
                </div>
                <div class="col-md-4">
                    <div class="thumbnail">
                        <div class="caption">
                            <h3>
                            <span class="glyphicon glyphicon-floppy-save glyphicon-align-left" aria-hidden="true"></span>
                            Firmware y Software</h3>
                            <p>
                                En <a href="https://github.com/RecunchoMaker/robik">nuestro github</a> est&aacute; disponible, tanto el firmware necesario para subir a Arduino, como algunos ejemplos de programas para jugar con tu robot. 
                                <p><a href="https://github.com/RecunchoMaker/robik" class="btn btn-primary" role="button">Ver m&aacute;s...</a> </p>
                        </div>
                    </div>
                </div>
            </div>
            <div class="row">
                <div class="col-xs-12 col-sm-12 col-md-7 col-lg-7">
                    <h1 class="borde">
                        <span class="glyphicon glyphicon-wrench glyphicon-align-left" aria-hidden="true"></span>
                        C&oacute;mo funciona
                    </h1>
                    <p>
                        <strong>Robik</strong> puede abrir y cerrar sus brazos para agarrar un cubo de Rubik de tamano standard. Cuando sus brazos est&aacute;n cerrados, girando la base se mueve la cara de la parte inferior del cubo. Los brazos tambi&eacute;n pueden subir y bajar de manera que cuando el brazo est&aacute; levantado, el servo de su mu&ntilde;eca permite girar el cubo entero sobre si mismo (en el eje X). Y si el cubo est&aacute; descansando en la base y los brazos est&aacute;n abiertos, girando la base el cubo gira sobre su eje Y.
                    </p>
                    <p>
                        Con estas simples instrucciones (abrir/cerrar brazos, girar mu&ntilde;eca, levantar/bajar brazos y girar base) se pueden hacer todos los movimientos posibles en un cubo
                    </p>
                    
                    <h1 class="borde">
                        <span class="glyphicon glyphicon-question-sign glyphicon-align-left" aria-hidden="true"></span>
                        Para qu&eacute; sirve
                    </h1>
                    <p>
                        Seamos sinceros: para bastante poco.
                    </p>
                    <p>
                        Este robot est&aacute; pensado para introducirse en el dise&ntilde;o 3D, aprender un poco sobre la programaci&oacute;n con Arduino, y luego permite experimentar con &eacute;l haciendo programas en cualquier lenguaje que tenga la posibilidad de utilzar el puerto serie (Python, C...). Es muy f&aacute;cil dise&ntilde;ar nuevas piezas (quiz&aacute; para incorporarle alg&uacute;n sensor, cambiar el tipo de motor), y es muy f&aacute;cil de programar un nuevo firmware (al fin y al cabo s&oacute;lo tiene tres servos y un motor!). 
                    </p>
                    <p>
                        Al mismo tiempo, la propia complejidad del cubo de Rubik abre las posibilidades para dise&ntilde;ar programas m&aacute;s complejos, como un entrenador de secuencias (para speedcubers) y, por qu&eacute; no, programar un solver utilizando una c&aacute;mara web.
                    </p>
                    
                </div>
                <div class="col-xs-12 col-sm-12 col-md-5 col-lg-5 caja">
<a data-flickr-embed="true"  href="https://www.flickr.com/photos/recunchomaker/23315713682/" title="2015 nov 28"><img class="img-responsive" src="https://farm6.staticflickr.com/5811/23315713682_eb296a37df_n.jpg" width="455" height="255" alt="2015 nov 28"></a><script async src="//embedr.flickr.com/assets/client-code.js" charset="utf-8"></script> <p class="center-block test-success small text-center">Primeros pasos de Robik</p>
</div>
                </div>
            </div>
            

